# DATA

In [1]:
import numpy as np
import pandas as pd

In [2]:
#!pip install seaborn

In [3]:
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
salaries = pd.read_csv("survey_results_public.csv",low_memory=False)

In [5]:
salaries.head()

,Respondent,Hobby,OpenSource,Country,Student,Employment,FormalEducation,UndergradMajor,CompanySize,DevType,...,Exercise,Gender,SexualOrientation,EducationParents,RaceEthnicity,Age,Dependents,MilitaryUS,SurveyTooLong,SurveyEasy
0,1,Yes,No,Kenya,No,Employed part-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Mathematics or statistics,20 to 99 employees,Full-stack developer,...,3 - 4 times per week,Male,Straight or heterosexual,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Black or of African descent,25 - 34 years old,Yes,NaN,The survey was an appropriate length,Very easy
1,3,Yes,Yes,United Kingdom,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)","A natural science (ex. biology, chemistry, phy...","10,000 or more employees",Database administrator;DevOps specialist;Full-...,...,Daily or almost every day,Male,Straight or heterosexual,"Bachelor’s degree (BA, BS, B.Eng., etc.)",White or of European descent,35 - 44 years old,Yes,NaN,The survey was an appropriate length,Somewhat easy
2,4,Yes,Yes,United States,No,Employed full-time,Associate degree,"Computer science, computer engineering, or sof...",20 to 99 employees,Engineering manager;Full-stack developer,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,5,No,No,United States,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",100 to 499 employees,Full-stack developer,...,I don't typically exercise,Male,Straight or heterosexual,Some college/university study without earning ...,White or of European descent,35 - 44 years old,No,No,The survey was an appropriate length,Somewhat easy
4,7,Yes,No,South Africa,"Yes, part-time",Employed full-time,Some college/university study without earning ...,"Computer science, computer engineering, or sof...","10,000 or more employees",Data or business analyst;Desktop or enterprise...,...,3 - 4 times per week,Male,Straight or heterosexual,Some college/university study without earning ...,White or of European descent,18 - 24 years old,Yes,NaN,The survey was an appropriate length,Somewhat easy

In [6]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98855 entries, 0 to 98854
Columns: 129 entries, Respondent to SurveyEasy
dtypes: float64(41), int64(1), object(87)
memory usage: 97.3+ MB

In [7]:
salaries.head()

,Respondent,Hobby,OpenSource,Country,Student,Employment,FormalEducation,UndergradMajor,CompanySize,DevType,...,Exercise,Gender,SexualOrientation,EducationParents,RaceEthnicity,Age,Dependents,MilitaryUS,SurveyTooLong,SurveyEasy
0,1,Yes,No,Kenya,No,Employed part-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Mathematics or statistics,20 to 99 employees,Full-stack developer,...,3 - 4 times per week,Male,Straight or heterosexual,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Black or of African descent,25 - 34 years old,Yes,NaN,The survey was an appropriate length,Very easy
1,3,Yes,Yes,United Kingdom,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)","A natural science (ex. biology, chemistry, phy...","10,000 or more employees",Database administrator;DevOps specialist;Full-...,...,Daily or almost every day,Male,Straight or heterosexual,"Bachelor’s degree (BA, BS, B.Eng., etc.)",White or of European descent,35 - 44 years old,Yes,NaN,The survey was an appropriate length,Somewhat easy
2,4,Yes,Yes,United States,No,Employed full-time,Associate degree,"Computer science, computer engineering, or sof...",20 to 99 employees,Engineering manager;Full-stack developer,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,5,No,No,United States,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",100 to 499 employees,Full-stack developer,...,I don't typically exercise,Male,Straight or heterosexual,Some college/university study without earning ...,White or of European descent,35 - 44 years old,No,No,The survey was an appropriate length,Somewhat easy
4,7,Yes,No,South Africa,"Yes, part-time",Employed full-time,Some college/university study without earning ...,"Computer science, computer engineering, or sof...","10,000 or more employees",Data or business analyst;Desktop or enterprise...,...,3 - 4 times per week,Male,Straight or heterosexual,Some college/university study without earning ...,White or of European descent,18 - 24 years old,Yes,NaN,The survey was an appropriate length,Somewhat easy

In [8]:
# countries with most data entries #
salaries[["Country"]].value_counts().head(10)

Country
United States         20309
India                 13721
Germany                6459
United Kingdom         6221
Canada                 3393
Russian Federation     2869
France                 2572
Brazil                 2505
Poland                 2122
Australia              2018
dtype: int64

In [9]:
## List of columns we are interested in for salary analysis #
#salaries_cols = ["Country","Student","Employment","FormalEducation","UndergradMajor","CompanySize","DevType","YearsCoding","YearsCodingProf","EducationTypes","SelfTaughtTypes","LanguageWorkedWith","Salary","LanguageDesireNextYear","FrameworkWorkedWith","FrameworkDesireNextYear","OperatingSystem","Age","ConvertedSalary"]

In [10]:
# Desired colums for analysis #
salaries_cols = ["Country","Student","Employment","FormalEducation","DevType","YearsCodingProf","EducationTypes","LanguageWorkedWith","FrameworkWorkedWith","Age","Salary","ConvertedSalary"]

In [11]:
salaries[salaries_cols].head()

,Country,Student,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary
0,Kenya,No,Employed part-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,3-5 years,"Taught yourself a new language, framework, or ...",JavaScript;Python;HTML;CSS,Django;React,25 - 34 years old,NaN,NaN
1,United Kingdom,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Database administrator;DevOps specialist;Full-...,18-20 years,"Taught yourself a new language, framework, or ...",JavaScript;Python;Bash/Shell,Django,35 - 44 years old,51000,70841.0
2,United States,No,Employed full-time,Associate degree,Engineering manager;Full-stack developer,6-8 years,NaN,NaN,NaN,NaN,NaN,NaN
3,United States,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,12-14 years,Completed an industry certification program (e...,C#;JavaScript;SQL;TypeScript;HTML;CSS;Bash/Shell,NaN,35 - 44 years old,NaN,NaN
4,South Africa,"Yes, part-time",Employed full-time,Some college/university study without earning ...,Data or business analyst;Desktop or enterprise...,0-2 years,Taken a part-time in-person course in programm...,C;C++;Java;Matlab;R;SQL;Bash/Shell,NaN,18 - 24 years old,260000,21426.0

In [12]:
salaries_final_cols = salaries[salaries_cols]
salaries_final_cols.head()

,Country,Student,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary
0,Kenya,No,Employed part-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,3-5 years,"Taught yourself a new language, framework, or ...",JavaScript;Python;HTML;CSS,Django;React,25 - 34 years old,NaN,NaN
1,United Kingdom,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Database administrator;DevOps specialist;Full-...,18-20 years,"Taught yourself a new language, framework, or ...",JavaScript;Python;Bash/Shell,Django,35 - 44 years old,51000,70841.0
2,United States,No,Employed full-time,Associate degree,Engineering manager;Full-stack developer,6-8 years,NaN,NaN,NaN,NaN,NaN,NaN
3,United States,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,12-14 years,Completed an industry certification program (e...,C#;JavaScript;SQL;TypeScript;HTML;CSS;Bash/Shell,NaN,35 - 44 years old,NaN,NaN
4,South Africa,"Yes, part-time",Employed full-time,Some college/university study without earning ...,Data or business analyst;Desktop or enterprise...,0-2 years,Taken a part-time in-person course in programm...,C;C++;Java;Matlab;R;SQL;Bash/Shell,NaN,18 - 24 years old,260000,21426.0

In [13]:
salaries_final_cols[["Country"]].value_counts().head(5)

Country
United States     20309
India             13721
Germany            6459
United Kingdom     6221
Canada             3393
dtype: int64

In [14]:
salariesTopCountry = salaries_final_cols[(salaries_final_cols["Country"] == "United States") | (salaries_final_cols["Country"] == "India") | (salaries_final_cols["Country"] == "Germany") | (salaries_final_cols["Country"] == "United Kingdom") | (salaries_final_cols["Country"] == "Canada")]

In [15]:
salariesTopCountry.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50103 entries, 1 to 98852
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              50103 non-null  object
 1   Student              48576 non-null  object
 2   Employment           48633 non-null  object
 3   FormalEducation      48261 non-null  object
 4   DevType              47135 non-null  object
 5   YearsCodingProf      40314 non-null  object
 6   EducationTypes       35792 non-null  object
 7   LanguageWorkedWith   40766 non-null  object
 8   FrameworkWorkedWith  26747 non-null  object
 9   Age                  33777 non-null  object
 10  Salary               26817 non-null  object
 11  ConvertedSalary      26171 non-null  float64
dtypes: float64(1), object(11)
memory usage: 5.0+ MB

In [16]:
#salariesTopCountry.to_csv("test.csv")

### Filling in missing data

In [17]:
salaries2 = salariesTopCountry.copy()
salaries2

,Country,Student,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary
1,United Kingdom,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Database administrator;DevOps specialist;Full-...,18-20 years,"Taught yourself a new language, framework, or ...",JavaScript;Python;Bash/Shell,Django,35 - 44 years old,51000,70841.0
2,United States,No,Employed full-time,Associate degree,Engineering manager;Full-stack developer,6-8 years,NaN,NaN,NaN,NaN,NaN,NaN
3,United States,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,12-14 years,Completed an industry certification program (e...,C#;JavaScript;SQL;TypeScript;HTML;CSS;Bash/Shell,NaN,35 - 44 years old,NaN,NaN
5,United Kingdom,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Database administrator;Fron...,3-5 years,Received on-the-job training in software devel...,Java;JavaScript;Python;TypeScript;HTML;CSS,Angular;Node.js,18 - 24 years old,30000,41671.0
6,United States,No,Employed full-time,Some college/university study without earning ...,Back-end developer;Front-end developer;Full-st...,0-2 years,Received on-the-job training in software devel...,JavaScript;HTML;CSS,Node.js;React,18 - 24 years old,120000,120000.0
...,...,...,...,...,...,...,...,...,...,...,...,...
98847,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98848,India,"Yes, full-time",Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98849,India,No,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98850,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98852,India,"Yes, full-time",Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
salaries2.columns

Index(['Country', 'Student', 'Employment', 'FormalEducation', 'DevType',
       'YearsCodingProf', 'EducationTypes', 'LanguageWorkedWith',
       'FrameworkWorkedWith', 'Age', 'Salary', 'ConvertedSalary'],
      dtype='object')

**Country col**

In [19]:
salaries2["Country"].value_counts()

United States     20309
India             13721
Germany            6459
United Kingdom     6221
Canada             3393
Name: Country, dtype: int64

**Student col**

In [20]:
salaries2["Student"].unique()

array(['No', 'Yes, full-time', nan, 'Yes, part-time'], dtype=object)

In [21]:
salaries2["Student"].value_counts()

No                37972
Yes, full-time     8719
Yes, part-time     1885
Name: Student, dtype: int64

In [22]:
# drop Student column #
salaries2.drop("Student",axis=1, inplace=True)

In [23]:
salaries2.columns

Index(['Country', 'Employment', 'FormalEducation', 'DevType',
       'YearsCodingProf', 'EducationTypes', 'LanguageWorkedWith',
       'FrameworkWorkedWith', 'Age', 'Salary', 'ConvertedSalary'],
      dtype='object')

**Employment**

In [24]:
salaries2["Employment"].unique()

array(['Employed full-time', 'Employed part-time',
       'Independent contractor, freelancer, or self-employed',
       'Not employed, and not looking for work', nan,
       'Not employed, but looking for work', 'Retired'], dtype=object)

In [25]:
salaries2["Employment"].value_counts()

Employed full-time                                      37916
Independent contractor, freelancer, or self-employed     3687
Not employed, but looking for work                       2734
Employed part-time                                       2241
Not employed, and not looking for work                   1923
Retired                                                   132
Name: Employment, dtype: int64

In [26]:
# Remove Retired entries #
salaries2[salaries2["Employment"] != "Retired"].head()

,Country,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary
1,United Kingdom,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Database administrator;DevOps specialist;Full-...,18-20 years,"Taught yourself a new language, framework, or ...",JavaScript;Python;Bash/Shell,Django,35 - 44 years old,51000,70841.0
2,United States,Employed full-time,Associate degree,Engineering manager;Full-stack developer,6-8 years,NaN,NaN,NaN,NaN,NaN,NaN
3,United States,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,12-14 years,Completed an industry certification program (e...,C#;JavaScript;SQL;TypeScript;HTML;CSS;Bash/Shell,NaN,35 - 44 years old,NaN,NaN
5,United Kingdom,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Database administrator;Fron...,3-5 years,Received on-the-job training in software devel...,Java;JavaScript;Python;TypeScript;HTML;CSS,Angular;Node.js,18 - 24 years old,30000,41671.0
6,United States,Employed full-time,Some college/university study without earning ...,Back-end developer;Front-end developer;Full-st...,0-2 years,Received on-the-job training in software devel...,JavaScript;HTML;CSS,Node.js;React,18 - 24 years old,120000,120000.0

In [27]:
salaries3 = salaries2[salaries2["Employment"] != "Retired"]

In [28]:
salaries3["Employment"].value_counts()

Employed full-time                                      37916
Independent contractor, freelancer, or self-employed     3687
Not employed, but looking for work                       2734
Employed part-time                                       2241
Not employed, and not looking for work                   1923
Name: Employment, dtype: int64

In [29]:
# Remove "Not employed, and not looking for work"
salaries4 = salaries3[salaries3["Employment"] != "Not employed, and not looking for work"]

In [30]:
salaries4["Employment"].value_counts()

Employed full-time                                      37916
Independent contractor, freelancer, or self-employed     3687
Not employed, but looking for work                       2734
Employed part-time                                       2241
Name: Employment, dtype: int64

In [31]:
salaries4["Employment"].unique()

array(['Employed full-time', 'Employed part-time',
       'Independent contractor, freelancer, or self-employed', nan,
       'Not employed, but looking for work'], dtype=object)

In [32]:
# Employment null values #
salaries4[salaries4["Employment"].isna()]

,Country,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary
80458,India,NaN,NaN,Back-end developer;Data scientist or machine l...,0-2 years,Contributed to open source software,C;C++;Java;JavaScript;PHP;Python;R;SQL;VB.NET;...,.NET Core;Django,18 - 24 years old,NaN,NaN
80459,India,NaN,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Educator or academic resear...,0-2 years,"Taught yourself a new language, framework, or ...",C;C++;C#;Java;JavaScript;Perl;PHP;SQL;TypeScri...,Angular;Node.js,18 - 24 years old,800000,12524.0
80490,Germany,NaN,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Student;System administrator,0-2 years,NaN,C;C++;Go;Java;Python;Bash/Shell,NaN,18 - 24 years old,NaN,NaN
80492,India,NaN,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,6-8 years,NaN,Java;JavaScript;Lua,Spring,NaN,NaN,NaN
80546,United States,NaN,"Secondary school (e.g. American high school, G...",Back-end developer;Front-end developer;Full-st...,0-2 years,Taken an online course in programming or softw...,C;Java;JavaScript;Python;Ruby;Swift;HTML;CSS,Django;Node.js;React;TensorFlow,18 - 24 years old,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
98816,India,NaN,"Professional degree (JD, MD, etc.)",Designer,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98820,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98844,India,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98847,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98850,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [33]:
# Remove nan from Employment col
salaries4.dropna(subset=["Employment"], inplace=True)

<ipython-input-33-16edcce55980>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4.dropna(subset=["Employment"], inplace=True)

In [34]:
salaries4[salaries4["Employment"].isnull()]

Empty DataFrame
Columns: [Country, Employment, FormalEducation, DevType, YearsCodingProf, EducationTypes, LanguageWorkedWith, FrameworkWorkedWith, Age, Salary, ConvertedSalary]
Index: []

In [35]:
salaries4["Employment"].value_counts()

Employed full-time                                      37916
Independent contractor, freelancer, or self-employed     3687
Not employed, but looking for work                       2734
Employed part-time                                       2241
Name: Employment, dtype: int64

In [36]:
# Replace "Independent contractor, freelancer, or self-employed" with "Independent contractor" #
salaries4["Employment"].replace("Independent contractor, freelancer, or self-employed","Independent contractor",inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:4509: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().replace(

In [37]:
# Replace "Not employed, but looking for work" with "looking for work" #
salaries4["Employment"].replace("Not employed, but looking for work","looking for work",inplace=True)

In [38]:
salaries4["Employment"].value_counts()

Employed full-time        37916
Independent contractor     3687
looking for work           2734
Employed part-time         2241
Name: Employment, dtype: int64

**Salary col**

In [39]:
# if there is no salary drop the row #
salaries4[salaries4["Salary"].isna()].head(10)

,Country,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary
2,United States,Employed full-time,Associate degree,Engineering manager;Full-stack developer,6-8 years,NaN,NaN,NaN,NaN,NaN,NaN
3,United States,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Full-stack developer,12-14 years,Completed an industry certification program (e...,C#;JavaScript;SQL;TypeScript;HTML;CSS;Bash/Shell,NaN,35 - 44 years old,NaN,NaN
9,India,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Designer,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,India,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Front-end developer;Full-st...,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,India,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Full-stack developer,3-5 years,NaN,Java,Spring,NaN,NaN,NaN
16,United States,Employed part-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Student,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,India,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Data or business analyst;Data scientist or mac...,3-5 years,Contributed to open source software,C;C++;C#,Angular,NaN,NaN,NaN
21,United States,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Desktop or enterprise appli...,24-26 years,Taken an online course in programming or softw...,C;C++;C#;Groovy;JavaScript;Python;SQL;HTML;CSS...,Django,45 - 54 years old,NaN,NaN
28,United States,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Data scientist or machine l...,3-5 years,NaN,NaN,NaN,NaN,NaN,NaN
29,United Kingdom,Employed full-time,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Back-end developer;Front-end developer;Full-st...,6-8 years,Taken an online course in programming or softw...,C#;Java;JavaScript;PHP;TypeScript;HTML;CSS,Angular;React,35 - 44 years old,NaN,NaN

In [40]:
salaries4.dropna(subset=["Salary"],inplace=True)

<ipython-input-40-0700b2e50b28>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4.dropna(subset=["Salary"],inplace=True)

In [41]:
# check if salary still has any null values #
len(salaries4[salaries4["Salary"].isna()])

0

In [42]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26299 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26299 non-null  object
 1   Employment           26299 non-null  object
 2   FormalEducation      25918 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      25935 non-null  object
 5   EducationTypes       25416 non-null  object
 6   LanguageWorkedWith   25714 non-null  object
 7   FrameworkWorkedWith  18063 non-null  object
 8   Age                  24809 non-null  object
 9   Salary               26299 non-null  object
 10  ConvertedSalary      25754 non-null  float64
dtypes: float64(1), object(10)
memory usage: 2.4+ MB

**FormalEducation**

In [43]:
salaries4["FormalEducation"].head()

1              Bachelor’s degree (BA, BS, B.Eng., etc.)
5              Bachelor’s degree (BA, BS, B.Eng., etc.)
6     Some college/university study without earning ...
8     Some college/university study without earning ...
22             Bachelor’s degree (BA, BS, B.Eng., etc.)
Name: FormalEducation, dtype: object

In [44]:
salaries4["FormalEducation"].unique()

array(['Bachelor’s degree (BA, BS, B.Eng., etc.)',
       'Some college/university study without earning a degree',
       'Master’s degree (MA, MS, M.Eng., MBA, etc.)', 'Associate degree',
       'Secondary school (e.g. American high school, German Realschule or Gymnasium, etc.)',
       'Primary/elementary school',
       'Other doctoral degree (Ph.D, Ed.D., etc.)', nan,
       'I never completed any formal education',
       'Professional degree (JD, MD, etc.)'], dtype=object)

In [45]:
salaries4["FormalEducation"].value_counts()

Bachelor’s degree (BA, BS, B.Eng., etc.)                                              14010
Master’s degree (MA, MS, M.Eng., MBA, etc.)                                            5452
Some college/university study without earning a degree                                 3119
Secondary school (e.g. American high school, German Realschule or Gymnasium, etc.)     1396
Associate degree                                                                        945
Other doctoral degree (Ph.D, Ed.D., etc.)                                               706
Professional degree (JD, MD, etc.)                                                      121
Primary/elementary school                                                               100
I never completed any formal education                                                   69
Name: FormalEducation, dtype: int64

In [46]:
# Deal with null values #

In [47]:
# we categorize the education into level:

# High --> 'Master’s degree (MA, MS, M.Eng., MBA, etc.)','Other doctoral degree (Ph.D, Ed.D., etc.)'
# Medium --> 'Bachelor’s degree (BA, BS, B.Eng., etc.)','Some college/university study without earning a degree','Associate degree', 'Professional degree (JD, MD, etc.)'
# low --> 'Primary/elementary school','Secondary school (e.g. American high school, German Realschule or Gymnasium, etc.)','I never completed any formal education',nan

In [48]:
salaries4["FormalEducation"].replace(["Master’s degree (MA, MS, M.Eng., MBA, etc.)","Other doctoral degree (Ph.D, Ed.D., etc.)"], "High", inplace=True)
salaries4["FormalEducation"].replace(["Bachelor’s degree (BA, BS, B.Eng., etc.)","Some college/university study without earning a degree","Associate degree", "Professional degree (JD, MD, etc.)"],"Medium", inplace=True)
salaries4["FormalEducation"].replace(["Primary/elementary school","Secondary school (e.g. American high school, German Realschule or Gymnasium, etc.)","I never completed any formal education",np.nan],"Low", inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:4509: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().replace(

In [49]:
salaries4["FormalEducation"].unique()

array(['Medium', 'High', 'Low'], dtype=object)

In [50]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26299 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26299 non-null  object
 1   Employment           26299 non-null  object
 2   FormalEducation      26299 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      25935 non-null  object
 5   EducationTypes       25416 non-null  object
 6   LanguageWorkedWith   25714 non-null  object
 7   FrameworkWorkedWith  18063 non-null  object
 8   Age                  24809 non-null  object
 9   Salary               26299 non-null  object
 10  ConvertedSalary      25754 non-null  float64
dtypes: float64(1), object(10)
memory usage: 2.4+ MB

**DevType**

In [51]:
salaries4["DevType"].unique()

array(['Database administrator;DevOps specialist;Full-stack developer;System administrator',
       'Back-end developer;Database administrator;Front-end developer;Full-stack developer',
       'Back-end developer;Front-end developer;Full-stack developer', ...,
       'Back-end developer;Data or business analyst;Data scientist or machine learning specialist;Student',
       'Back-end developer;Data scientist or machine learning specialist;Database administrator;Designer;Desktop or enterprise applications developer;Front-end developer;Full-stack developer;Student',
       'Back-end developer;Database administrator;Desktop or enterprise applications developer;Front-end developer;Full-stack developer;Mobile developer;Product manager;QA or test developer;Student'],
      dtype=object)

In [52]:
salaries4["DevType"].value_counts()

Full-stack developer                                                                                                                                                          2111
Back-end developer                                                                                                                                                            1789
Back-end developer;Front-end developer;Full-stack developer                                                                                                                   1447
Back-end developer;Full-stack developer                                                                                                                                       1065
Mobile developer                                                                                                                                                               929
                                                                                                                                                                              ...
Desktop or enterprise applications developer;DevOps specialist;Embedded applications or devices developer;System administrator                                                   1
Database administrator;Educator or academic researcher;Engineering manager;Front-end developer;Full-stack developer;System administrator                                         1
Back-end developer;Data scientist or machine learning specialist;Database administrator;Desktop or enterprise applications developer;Full-stack developer;Mobile developer       1
Back-end developer;Data scientist or machine learning specialist;Designer;DevOps specialist;Front-end developer;Full-stack developer;Student                                     1
Data or business analyst;Designer;Front-end developer;QA or test developer                                                                                                       1
Name: DevType, Length: 3993, dtype: int64

In [53]:
salaries4.loc[1,"DevType"]

'Database administrator;DevOps specialist;Full-stack developer;System administrator'

In [54]:
salaries4["DevType"].head()

1     Database administrator;DevOps specialist;Full-...
5     Back-end developer;Database administrator;Fron...
6     Back-end developer;Front-end developer;Full-st...
8     Back-end developer;C-suite executive (CEO, CTO...
22    Back-end developer;Database administrator;Desi...
Name: DevType, dtype: object

In [55]:
# Change the entries in the Devtype col to list # 
salaries4["DevType"].str.split(";").head()

1     [Database administrator, DevOps specialist, Fu...
5     [Back-end developer, Database administrator, F...
6     [Back-end developer, Front-end developer, Full...
8     [Back-end developer, C-suite executive (CEO, C...
22    [Back-end developer, Database administrator, D...
Name: DevType, dtype: object

In [56]:
# From each list entry choose the first choice #
salaries4["DevType"].str.split(";").str[0].head()

1     Database administrator
5         Back-end developer
6         Back-end developer
8         Back-end developer
22        Back-end developer
Name: DevType, dtype: object

In [57]:
# save changes #
salaries4["DevType"] = salaries4["DevType"].str.split(";").str[0]

<ipython-input-57-fbce09215c00>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4["DevType"] = salaries4["DevType"].str.split(";").str[0]

In [58]:
salaries4["DevType"].unique()

array(['Database administrator', 'Back-end developer', 'Mobile developer',
       'Full-stack developer', 'Designer', 'Front-end developer',
       'Engineering manager',
       'Embedded applications or devices developer',
       'Data scientist or machine learning specialist',
       'Desktop or enterprise applications developer',
       'C-suite executive (CEO, CTO, etc.)', 'QA or test developer',
       'System administrator', 'Data or business analyst',
       'DevOps specialist', nan, 'Educator or academic researcher',
       'Student', 'Game or graphics developer', 'Product manager',
       'Marketing or sales professional'], dtype=object)

In [59]:
salaries4["DevType"].value_counts()

Back-end developer                               15479
Full-stack developer                              2446
Front-end developer                               1636
Mobile developer                                   990
Desktop or enterprise applications developer       939
Data or business analyst                           807
Data scientist or machine learning specialist      688
Designer                                           607
DevOps specialist                                  488
Embedded applications or devices developer         423
Database administrator                             329
Engineering manager                                275
Student                                            251
C-suite executive (CEO, CTO, etc.)                 239
QA or test developer                               199
Educator or academic researcher                    124
Game or graphics developer                          72
System administrator                                72
Product manager                                     14
Marketing or sales professional                      7
Name: DevType, dtype: int64

In [60]:
# view null values in DevType col #
salaries4[salaries4["DevType"].isna()]

,Country,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary
461,Canada,Employed full-time,Medium,NaN,30 or more years,Received on-the-job training in software devel...,C;C++;Python;Bash/Shell,NaN,NaN,120000,96626.0
1868,United States,Employed full-time,Medium,NaN,3-5 years,"Taught yourself a new language, framework, or ...",C++,NaN,18 - 24 years old,70000,70000.0
2044,Canada,Employed full-time,Medium,NaN,6-8 years,Received on-the-job training in software devel...,Assembly;C;C++;Java;Perl;Cobol;Bash/Shell,NaN,25 - 34 years old,98000,78911.0
3237,United Kingdom,Employed full-time,High,NaN,24-26 years,Received on-the-job training in software devel...,C++;C#;JavaScript;Python,.NET Core,45 - 54 years old,50000,69452.0
3448,United States,Employed full-time,Medium,NaN,3-5 years,"Taught yourself a new language, framework, or ...",C;C++;Python,NaN,25 - 34 years old,96000,96000.0
...,...,...,...,...,...,...,...,...,...,...,...
87930,India,looking for work,Medium,NaN,NaN,Taken a part-time in-person course in programm...,C;Java;Matlab;Python;HTML;CSS,TensorFlow;Torch/PyTorch,18 - 24 years old,0,NaN
88418,United States,Employed part-time,Low,NaN,NaN,Received on-the-job training in software devel...,C++;C#;JavaScript;Matlab;Ruby;SQL;HTML;CSS,.NET Core,18 - 24 years old,100,5000.0
88732,India,looking for work,Medium,NaN,NaN,Contributed to open source software,C++,NaN,NaN,800,650.0
89398,United States,looking for work,Medium,NaN,NaN,Taken a part-time in-person course in programm...,C;VB.NET;Visual Basic 6;Bash/Shell,.NET Core,18 - 24 years old,25000,25000.0
89871,United Kingdom,Employed part-time,Medium,NaN,NaN,Participated in online coding competitions (e....,Java;Python;SQL;HTML;CSS,NaN,18 - 24 years old,200,13900.0

In [61]:
# drop null in DevType values #
salaries4.dropna(subset=["DevType"], inplace=True)

<ipython-input-61-53d47661edca>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4.dropna(subset=["DevType"], inplace=True)

In [62]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      25760 non-null  object
 5   EducationTypes       25211 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  24615 non-null  object
 9   Salary               26085 non-null  object
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(1), object(10)
memory usage: 2.4+ MB

**YearsCodingProf**

In [63]:
salaries4["YearsCodingProf"].unique()

array(['18-20 years', '3-5 years', '0-2 years', '21-23 years',
       '6-8 years', '9-11 years', '12-14 years', '15-17 years',
       '30 or more years', '24-26 years', '27-29 years', nan],
      dtype=object)

In [64]:
salaries4["YearsCodingProf"].value_counts()

3-5 years           7286
0-2 years           5995
6-8 years           3924
9-11 years          2763
12-14 years         1621
18-20 years         1209
15-17 years         1206
21-23 years          605
30 or more years     547
24-26 years          386
27-29 years          218
Name: YearsCodingProf, dtype: int64

replacing:

- 0-2 years --> 1 etc

In [65]:
salaries4["YearsCodingProf"].replace('0-2 years',1,inplace=True)
salaries4["YearsCodingProf"].replace('6-8 years',7,inplace=True)
salaries4["YearsCodingProf"].replace(np.nan,0,inplace=True)
salaries4["YearsCodingProf"].replace('3-5 years',5,inplace=True)
salaries4["YearsCodingProf"].replace('27-29 years',28,inplace=True)
salaries4["YearsCodingProf"].replace('18-20 years',19,inplace=True)
salaries4["YearsCodingProf"].replace('12-14 years',13,inplace=True)
salaries4["YearsCodingProf"].replace('9-11 years',10,inplace=True)
salaries4["YearsCodingProf"].replace('21-23 years',22,inplace=True)
salaries4["YearsCodingProf"].replace('15-17 years',16,inplace=True)
salaries4["YearsCodingProf"].replace('24-26 years',25,inplace=True)
salaries4["YearsCodingProf"].replace('30 or more years',30,inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:4509: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().replace(

In [66]:
salaries4["YearsCodingProf"].unique()

array([19,  5,  1, 22,  7, 10, 13, 16, 30, 25, 28,  0], dtype=int64)

In [67]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       25211 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  24615 non-null  object
 9   Salary               26085 non-null  object
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(1), int64(1), object(9)
memory usage: 2.4+ MB

**EducationTypes**

In [68]:
len(salaries4["EducationTypes"].unique())

439

In [69]:
salaries4["EducationTypes"].value_counts().head()

Taught yourself a new language, framework, or tool without taking a formal course                                                                                                                                     2269
Taught yourself a new language, framework, or tool without taking a formal course;Contributed to open source software                                                                                                 1574
Taken an online course in programming or software development (e.g. a MOOC);Taught yourself a new language, framework, or tool without taking a formal course                                                         1343
Received on-the-job training in software development;Taught yourself a new language, framework, or tool without taking a formal course                                                                                1142
Taken an online course in programming or software development (e.g. a MOOC);Received on-the-job training in software development;Taught yourself a new language, framework, or tool without taking a formal course     818
Name: EducationTypes, dtype: int64

In [70]:
salaries4["EducationTypes"].value_counts().tail()

Taken an online course in programming or software development (e.g. a MOOC);Participated in a full-time developer training program or bootcamp;Received on-the-job training in software development;Participated in online coding competitions (e.g. HackerRank, CodeChef, TopCoder)    1
Taken a part-time in-person course in programming or software development;Participated in online coding competitions (e.g. HackerRank, CodeChef, TopCoder);Participated in a hackathon                                                                                                  1
Taken an online course in programming or software development (e.g. a MOOC);Completed an industry certification program (e.g. MCPD);Received on-the-job training in software development;Participated in a hackathon;Contributed to open source software                                1
Completed an industry certification program (e.g. MCPD);Received on-the-job training in software development;Participated in online coding competitions (e.g. HackerRank, CodeChef, TopCoder)                                                                                           1
Participated in a full-time developer training program or bootcamp;Taken a part-time in-person course in programming or software development;Completed an industry certification program (e.g. MCPD);Received on-the-job training in software development                               1
Name: EducationTypes, dtype: int64

In [71]:
salaries4["EducationTypes"][5]

'Received on-the-job training in software development;Taught yourself a new language, framework, or tool without taking a formal course;Participated in online coding competitions (e.g. HackerRank, CodeChef, TopCoder)'

In [72]:
# turn each row in col to array #
salaries4["EducationTypes"].str.split(";")

1        [Taught yourself a new language, framework, or...
5        [Received on-the-job training in software deve...
6        [Received on-the-job training in software deve...
8        [Taken an online course in programming or soft...
22       [Taught yourself a new language, framework, or...
                               ...
89904    [Taken an online course in programming or soft...
89911    [Taken a part-time in-person course in program...
89928    [Taken an online course in programming or soft...
89932    [Taught yourself a new language, framework, or...
89965    [Participated in a full-time developer trainin...
Name: EducationTypes, Length: 26085, dtype: object

In [73]:
# select first element in each list #
salaries4["EducationTypes"].str.split(";").str[0].head(1)

1    Taught yourself a new language, framework, or ...
Name: EducationTypes, dtype: object

In [74]:
## test #
#sal2 = salaries4.copy()

In [75]:
# select first element in each list #
salaries4["EducationTypes"] = salaries4["EducationTypes"].str.split(";").str[0]

<ipython-input-75-19b67ced3e37>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4["EducationTypes"] = salaries4["EducationTypes"].str.split(";").str[0]

In [76]:
salaries4["EducationTypes"].unique()

array(['Taught yourself a new language, framework, or tool without taking a formal course',
       'Received on-the-job training in software development',
       'Taken an online course in programming or software development (e.g. a MOOC)',
       'Participated in a full-time developer training program or bootcamp',
       'Taken a part-time in-person course in programming or software development',
       'Completed an industry certification program (e.g. MCPD)', nan,
       'Contributed to open source software',
       'Participated in a hackathon',
       'Participated in online coding competitions (e.g. HackerRank, CodeChef, TopCoder)'],
      dtype=object)

In [77]:
salaries4["EducationTypes"].value_counts()

Taken an online course in programming or software development (e.g. a MOOC)          11822
Taught yourself a new language, framework, or tool without taking a formal course     5927
Received on-the-job training in software development                                  3438
Taken a part-time in-person course in programming or software development             1380
Participated in a full-time developer training program or bootcamp                    1122
Completed an industry certification program (e.g. MCPD)                               1122
Participated in online coding competitions (e.g. HackerRank, CodeChef, TopCoder)       160
Contributed to open source software                                                    134
Participated in a hackathon                                                            106
Name: EducationTypes, dtype: int64

In [78]:
# WILL DEAL WITH NULL VALUES LATER #

In [79]:
# null vals #
salaries4[["EducationTypes","LanguageWorkedWith"]][salaries4["EducationTypes"].isna()].head(15)

    EducationTypes                                 LanguageWorkedWith
85             NaN          Java;JavaScript;Swift;TypeScript;HTML;CSS
106            NaN                                             C;Java
226            NaN                              JavaScript;PHP;Python
274            NaN                    Java;JavaScript;HTML;Bash/Shell
443            NaN                                                NaN
448            NaN                                                NaN
494            NaN                                      Java;SQL;HTML
518            NaN                            PHP;TypeScript;HTML;CSS
532            NaN             C#;Java;JavaScript;PHP;VB.NET;HTML;CSS
570            NaN  C;C++;Java;JavaScript;PHP;SQL;HTML;CSS;Bash/Shell
599            NaN                                                NaN
710            NaN                                    Java;JavaScript
733            NaN                         C#;JavaScript;SQL;HTML;CSS
803            NaN          C;Java;JavaScript;SQL;TypeScript;HTML;CSS
833            NaN                   Java;SQL;Visual Basic 6;HTML;CSS

In [80]:
# for now assume NaN means "Taught yourself a new language, framework, or tool without taking a formal course" #
salaries4["EducationTypes"].replace(np.nan,"Taught yourself a new language, framework, or tool without taking a formal course", inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:4509: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().replace(

In [81]:
# null vals #
salaries4[["EducationTypes","LanguageWorkedWith"]][salaries4["EducationTypes"].isna()]

Empty DataFrame
Columns: [EducationTypes, LanguageWorkedWith]
Index: []

In [82]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  24615 non-null  object
 9   Salary               26085 non-null  object
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(1), int64(1), object(9)
memory usage: 3.4+ MB

**LanguageWorkedWith**

In [83]:
salaries4["LanguageWorkedWith"].unique()

array(['JavaScript;Python;Bash/Shell',
       'Java;JavaScript;Python;TypeScript;HTML;CSS',
       'JavaScript;HTML;CSS', ..., 'C;C++;HTML;CSS', 'C++;Java;VB.NET',
       'Assembly;C;C++;Java;Python;Scala;Ocaml'], dtype=object)

In [84]:
salaries4["LanguageWorkedWith"].value_counts().head(30)

C#;JavaScript;SQL;HTML;CSS                          541
C#;JavaScript;SQL;TypeScript;HTML;CSS               338
JavaScript;PHP;SQL;HTML;CSS                         337
JavaScript;PHP;SQL;HTML;CSS;Bash/Shell              287
JavaScript;HTML;CSS                                 264
Java                                                232
JavaScript;PHP;HTML;CSS                             188
Java;JavaScript;SQL;HTML;CSS                        145
C#                                                  134
JavaScript;TypeScript;HTML;CSS                      131
C#;SQL                                              127
C#;JavaScript;SQL;VB.NET;HTML;CSS                   127
JavaScript;PHP;Python;SQL;HTML;CSS;Bash/Shell       122
Objective-C;Swift                                   121
Java;JavaScript;SQL;HTML;CSS;Bash/Shell             119
C#;JavaScript;HTML;CSS                              110
Java;JavaScript;HTML;CSS                            108
JavaScript;Python;SQL;HTML;CSS;Bash/Shell           103
JavaScript;HTML;CSS;Bash/Shell                       96
C#;JavaScript;SQL;TypeScript;HTML;CSS;Bash/Shell     92
C#;JavaScript;PHP;SQL;HTML;CSS                       92
C#;JavaScript;SQL;HTML;CSS;Bash/Shell                91
C#;JavaScript;TypeScript;HTML;CSS                    91
JavaScript;Python;HTML;CSS;Bash/Shell                86
C#;JavaScript;SQL                                    84
Python                                               82
C#;Java;JavaScript;SQL;HTML;CSS                      78
Java;JavaScript;Python;SQL;HTML;CSS;Bash/Shell       77
JavaScript;Python;HTML;CSS                           77
Java;SQL                                             71
Name: LanguageWorkedWith, dtype: int64

In [85]:
# make a list #
salaries4["LanguageWorkedWith"].str.split(";").value_counts()

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas\_libs\hashtable_class_helper.pxi", line 4588, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

[C#, JavaScript, SQL, HTML, CSS]                                  541
[C#, JavaScript, SQL, TypeScript, HTML, CSS]                      338
[JavaScript, PHP, SQL, HTML, CSS]                                 337
[JavaScript, PHP, SQL, HTML, CSS, Bash/Shell]                     287
[JavaScript, HTML, CSS]                                           264
                                                                 ...
[C#, Erlang, JavaScript, Python, Bash/Shell]                        1
[C, C++, C#, Java, JavaScript, Perl, Swift, VB.NET, HTML, CSS]      1
[Java, Rust, TypeScript, HTML, CSS]                                 1
[C++, Go, JavaScript]                                               1
[C++, Haskell, Java, Matlab, Python, Bash/Shell]                    1
Name: LanguageWorkedWith, Length: 11173, dtype: int64

In [86]:
# grab the first list item #

**FrameworkWorkedWith**

In [87]:
len(salaries4["FrameworkWorkedWith"].unique())

655

In [88]:
salaries4["FrameworkWorkedWith"].value_counts().head(20)

.NET Core                          1548
Node.js                            1436
Node.js;React                      1406
Angular;Node.js                     922
Angular                             867
Spring                              842
React                               696
Angular;Node.js;React               636
Django                              582
Angular;.NET Core                   496
Angular;.NET Core;Node.js           484
.NET Core;Node.js                   383
TensorFlow                          339
Angular;Node.js;Spring              267
Angular;.NET Core;Node.js;React     257
Angular;Spring                      252
.NET Core;Xamarin                   250
.NET Core;Node.js;React             235
Node.js;Spring                      190
Django;Node.js;React                176
Name: FrameworkWorkedWith, dtype: int64

In [89]:
# WILL GET BACK TO IT #

**Age**

In [90]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  24615 non-null  object
 9   Salary               26085 non-null  object
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(1), int64(1), object(9)
memory usage: 3.4+ MB

In [91]:
salaries4["Age"].unique()

array(['35 - 44 years old', '18 - 24 years old', '25 - 34 years old',
       '45 - 54 years old', nan, '55 - 64 years old', '65 years or older',
       'Under 18 years old'], dtype=object)

In [92]:
salaries4["Age"].value_counts()

25 - 34 years old     12721
35 - 44 years old      4965
18 - 24 years old      4804
45 - 54 years old      1541
55 - 64 years old       420
Under 18 years old      120
65 years or older        44
Name: Age, dtype: int64

Replace:

"18 - 24 years old" --> 21 etc

In [93]:
salaries4["Age"].replace("18 - 24 years old",21,inplace=True)
salaries4["Age"].replace("25 - 34 years old",30,inplace=True)
salaries4["Age"].replace("Under 18 years old",18,inplace=True)
salaries4["Age"].replace("35 - 44 years old",40,inplace=True)
salaries4["Age"].replace("45 - 54 years old",50,inplace=True)
salaries4["Age"].replace("55 - 64 years old",60,inplace=True)
# since most people are between 25 - 34 years old, for nan --> 30 #
salaries4["Age"].replace(np.nan,30,inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:4509: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().replace(

In [94]:
salaries4["Age"].unique()

array([40, 21, 30, 50, 60, '65 years or older', 18], dtype=object)

**ConvertedSalary**

In [95]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  26085 non-null  object
 9   Salary               26085 non-null  object
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(1), int64(1), object(9)
memory usage: 3.4+ MB

In [96]:
salaries4[["Country","Salary","ConvertedSalary"]][salaries4["ConvertedSalary"].isna()]

             Country  Salary  ConvertedSalary
191          Germany     600              NaN
415            India   95000              NaN
434            India  910000              NaN
483            India  380000              NaN
781          Germany    3850              NaN
...              ...     ...              ...
89739  United States       0              NaN
89758          India  150000              NaN
89843  United States       0              NaN
89900          India       0              NaN
89928        Germany     600              NaN

[539 rows x 3 columns]

In [97]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  26085 non-null  object
 9   Salary               26085 non-null  object
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(1), int64(1), object(9)
memory usage: 3.4+ MB

In [98]:
# TEST #
#sal4 = salaries4.copy()

In [99]:
# FIGURE OUT HOW TO REMOVE COMMAS FROM SALARY COL #

In [100]:
# split array into individual elements and then replace "," with "."
salaries4["Salary"].str.split(",").tail(20)

89634      [1000]
89655        [80]
89660         [0]
89670         [0]
89683      [7.50]
89684         [0]
89695      [7000]
89725         [0]
89733     [45000]
89739         [0]
89741         [0]
89758    [150000]
89843         [0]
89888      [1000]
89900         [0]
89904         [0]
89911     [10000]
89928       [600]
89932     [70000]
89965         [0]
Name: Salary, dtype: object

In [101]:
# save changes #
salaries4["Salary"] = salaries4["Salary"].str.split(",").replace(",",".")

<ipython-input-101-b0079c981761>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4["Salary"] = salaries4["Salary"].str.split(",").replace(",",".")

In [102]:
# sice the commas are out we can group back the numbers #
salaries4["Salary"].str.join("")

1         51000
5         30000
6        120000
8        250000
22           25
          ...
89904         0
89911     10000
89928       600
89932     70000
89965         0
Name: Salary, Length: 26085, dtype: object

In [103]:
# save changes #
salaries4["Salary"] = salaries4["Salary"].str.join("")

<ipython-input-103-4586a6c32206>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4["Salary"] = salaries4["Salary"].str.join("")

In [104]:
salaries4["Salary"] = salaries4["Salary"].astype(float)
salaries4.dtypes

<ipython-input-104-6646ccc27b66>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries4["Salary"] = salaries4["Salary"].astype(float)

Country                 object
Employment              object
FormalEducation         object
DevType                 object
YearsCodingProf          int64
EducationTypes          object
LanguageWorkedWith      object
FrameworkWorkedWith     object
Age                     object
Salary                 float64
ConvertedSalary        float64
dtype: object

In [105]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  26085 non-null  object
 9   Salary               26085 non-null  float64
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 3.4+ MB

In [106]:
salaries4[["Country","Salary","ConvertedSalary"]][salaries4["ConvertedSalary"].isna()]

             Country    Salary  ConvertedSalary
191          Germany     600.0              NaN
415            India   95000.0              NaN
434            India  910000.0              NaN
483            India  380000.0              NaN
781          Germany    3850.0              NaN
...              ...       ...              ...
89739  United States       0.0              NaN
89758          India  150000.0              NaN
89843  United States       0.0              NaN
89900          India       0.0              NaN
89928        Germany     600.0              NaN

[539 rows x 3 columns]

In [107]:
# When the "Salary" == 0 then "ConvertedSalary" == 0 #
salaries4[["Salary","ConvertedSalary"]][salaries4["Salary"] == 0]

       Salary  ConvertedSalary
4395      0.0              0.0
5043      0.0              NaN
6557      0.0              0.0
11189     0.0              0.0
11193     0.0              0.0
...       ...              ...
89741     0.0              0.0
89843     0.0              NaN
89900     0.0              NaN
89904     0.0              0.0
89965     0.0              0.0

[391 rows x 2 columns]

In [177]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  26085 non-null  object
 9   Salary               26085 non-null  float64
 10  ConvertedSalary      25546 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 3.4+ MB

In [108]:
# TEST #
#sal5 = salaries4.copy()

In [178]:
salaries4.loc[salaries4["Salary"] == 0,["Salary","ConvertedSalary"]]

       Salary  ConvertedSalary
4395      0.0              0.0
5043      0.0              NaN
6557      0.0              0.0
11189     0.0              0.0
11193     0.0              0.0
...       ...              ...
89741     0.0              0.0
89843     0.0              NaN
89900     0.0              NaN
89904     0.0              0.0
89965     0.0              0.0

[391 rows x 2 columns]

In [179]:
# when Salary is 0 and ConvertedSalary is NaN #
salaries4.loc[(salaries4["Salary"] == 0) & (salaries4["ConvertedSalary"].isnull()),["Salary","ConvertedSalary"]]

       Salary  ConvertedSalary
5043      0.0              NaN
35725     0.0              NaN
38127     0.0              NaN
54919     0.0              NaN
65985     0.0              NaN
...       ...              ...
89670     0.0              NaN
89725     0.0              NaN
89739     0.0              NaN
89843     0.0              NaN
89900     0.0              NaN

[116 rows x 2 columns]

In [180]:
# where 'Salary' is 0 and 'ConvertedSalary' is NaN replace 'ConvertedSalary' with the corisponding 'Salary' value #
salaries4.loc[(salaries4["Salary"] == 0) & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"] = salaries4["Salary"]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [181]:
# view result
salaries4.loc[(salaries4["Salary"] == 0) & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"]

Series([], Name: ConvertedSalary, dtype: float64)

In [182]:
# view the country and salary and convertedsalary #
salaries4.loc[(salaries4["ConvertedSalary"] == 0) | (salaries4["ConvertedSalary"].isnull()),["Country","Salary","ConvertedSalary"]]

             Country    Salary  ConvertedSalary
191          Germany     600.0              NaN
415            India   95000.0              NaN
434            India  910000.0              NaN
483            India  380000.0              NaN
488            India      23.0              0.0
...              ...       ...              ...
89843  United States       0.0              0.0
89900          India       0.0              0.0
89904         Canada       0.0              0.0
89928        Germany     600.0              NaN
89965          India       0.0              0.0

[879 rows x 3 columns]

In [183]:
# view the countries we need currency changes for #
salaries4.loc[(salaries4["ConvertedSalary"] == 0) | (salaries4["ConvertedSalary"].isnull()),["Country"]].value_counts()

Country
India             401
United States     230
Germany           141
United Kingdom     57
Canada             50
dtype: int64

- India to USD*0.01381
- Germany to USD*1.09
- United Kingdom to USD*1.30
- Canada to USD*0.77610

In [184]:
# For India #
salaries4.loc[salaries4["Country"]=="India",["Country","Salary","ConvertedSalary"]].tail(10)

      Country    Salary  ConvertedSalary
89309   India    5000.0            936.0
89363   India       0.0              0.0
89517   India  700000.0          10958.0
89634   India    1000.0            800.0
89660   India       0.0              0.0
89725   India       0.0              0.0
89758   India  150000.0              NaN
89888   India    1000.0            800.0
89900   India       0.0              0.0
89965   India       0.0              0.0

In [185]:
# Show where counrty is India and converted salary is null
salaries4.loc[(salaries4["Country"]=="India") & (salaries4["ConvertedSalary"].isnull()), ["Country","Salary","ConvertedSalary"]]

      Country    Salary  ConvertedSalary
415     India   95000.0              NaN
434     India  910000.0              NaN
483     India  380000.0              NaN
811     India  850000.0              NaN
1554    India   30000.0              NaN
...       ...       ...              ...
83055   India       8.7              NaN
85702   India  900000.0              NaN
87458   India    1000.0              NaN
88319   India   35000.0              NaN
89758   India  150000.0              NaN

[204 rows x 3 columns]

In [187]:
# set the null values in the condition below to the curency change #
salaries4.loc[(salaries4["Country"]=="India") & (salaries4["ConvertedSalary"].isnull()), "ConvertedSalary"]

415     NaN
434     NaN
483     NaN
811     NaN
1554    NaN
         ..
83055   NaN
85702   NaN
87458   NaN
88319   NaN
89758   NaN
Name: ConvertedSalary, Length: 204, dtype: float64

In [188]:
# currency converion #
salaries4.loc[(salaries4["Country"]=="India") & (salaries4["ConvertedSalary"].isnull()), "Salary"] * 0.01381

415       1311.950000
434      12567.100000
483       5247.800000
811      11738.500000
1554       414.300000
             ...
83055        0.120147
85702    12429.000000
87458       13.810000
88319      483.350000
89758     2071.500000
Name: Salary, Length: 204, dtype: float64

In [189]:
# Currency converion appllied to the dataframe column under the specified conditions #
salaries4.loc[
    (salaries4["Country"]=="India") & (salaries4["ConvertedSalary"].isnull()), "ConvertedSalary"
] = salaries4.loc[(salaries4["Country"]=="India") & (salaries4["ConvertedSalary"].isnull()), "Salary"] * 0.01381

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [190]:
# shows no null values exist within the specified condition #
salaries4.loc[(salaries4["Country"]=="India") & (salaries4["ConvertedSalary"].isnull()), ["Salary","ConvertedSalary"]]

Empty DataFrame
Columns: [Salary, ConvertedSalary]
Index: []

In [191]:
salaries4.loc[salaries4["Country"]=="India", ["Salary","ConvertedSalary"]]

          Salary  ConvertedSalary
24      700000.0          10958.0
41      660000.0         123984.0
45       35000.0           6576.0
93     2200000.0          34440.0
95       22000.0           4128.0
...          ...              ...
89725        0.0              0.0
89758   150000.0           2071.5
89888     1000.0            800.0
89900        0.0              0.0
89965        0.0              0.0

[4231 rows x 2 columns]

In [192]:
# FOR GERMANY #
salaries4.loc[(salaries4["Country"]=="Germany") & (salaries4["ConvertedSalary"].isnull()),["Country","Salary","ConvertedSalary"]]

       Country   Salary  ConvertedSalary
191    Germany    600.0              NaN
781    Germany   3850.0              NaN
1690   Germany   4000.0              NaN
2398   Germany   3333.0              NaN
2473   Germany   7750.0              NaN
...        ...      ...              ...
77832  Germany  15000.0              NaN
78173  Germany   1400.0              NaN
78584  Germany    360.0              NaN
84026  Germany   2500.0              NaN
89928  Germany    600.0              NaN

[115 rows x 3 columns]

In [193]:
# values that need conversion #
salaries4.loc[(salaries4["Country"]=="Germany") & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"]

191     NaN
781     NaN
1690    NaN
2398    NaN
2473    NaN
         ..
77832   NaN
78173   NaN
78584   NaN
84026   NaN
89928   NaN
Name: ConvertedSalary, Length: 115, dtype: float64

In [194]:
# Conversion #
salaries4.loc[(salaries4["Country"]=="Germany") & (salaries4["ConvertedSalary"].isnull()), "Salary"] * 1.09

191        654.00
781       4196.50
1690      4360.00
2398      3632.97
2473      8447.50
           ...
77832    16350.00
78173     1526.00
78584      392.40
84026     2725.00
89928      654.00
Name: Salary, Length: 115, dtype: float64

In [195]:
# Conversion applied #
salaries4.loc[
    (salaries4["Country"]=="Germany") & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"
] = salaries4.loc[(salaries4["Country"]=="Germany") & (salaries4["ConvertedSalary"].isnull()), "Salary"] * 1.09

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [196]:
salaries4.loc[
    (salaries4["Country"]=="Germany") & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"
]

Series([], Name: ConvertedSalary, dtype: float64)

In [197]:
# FOR United Kingdom to USD*1.30 #
salaries4.loc[(salaries4["Country"]=="United Kingdom") & (salaries4["ConvertedSalary"].isnull()),["Country","Salary","ConvertedSalary"]]

              Country    Salary  ConvertedSalary
17989  United Kingdom    4100.0              NaN
30207  United Kingdom    1500.0              NaN
39992  United Kingdom      34.0              NaN
43740  United Kingdom    7800.0              NaN
45504  United Kingdom    7800.0              NaN
51058  United Kingdom    3500.0              NaN
55613  United Kingdom   13500.0              NaN
60518  United Kingdom  100000.0              NaN
69365  United Kingdom   12000.0              NaN
73666  United Kingdom    2000.0              NaN
77515  United Kingdom     160.0              NaN
78402  United Kingdom    2600.0              NaN
80376  United Kingdom      37.0              NaN
87947  United Kingdom      10.0              NaN

In [198]:
# Values need conversion #
salaries4.loc[(salaries4["Country"]=="United Kingdom") & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"]

17989   NaN
30207   NaN
39992   NaN
43740   NaN
45504   NaN
51058   NaN
55613   NaN
60518   NaN
69365   NaN
73666   NaN
77515   NaN
78402   NaN
80376   NaN
87947   NaN
Name: ConvertedSalary, dtype: float64

In [199]:
# conversion #
salaries4.loc[(salaries4["Country"]=="United Kingdom") & (salaries4["ConvertedSalary"].isnull()),"Salary"]*1.30

17989      5330.0
30207      1950.0
39992        44.2
43740     10140.0
45504     10140.0
51058      4550.0
55613     17550.0
60518    130000.0
69365     15600.0
73666      2600.0
77515       208.0
78402      3380.0
80376        48.1
87947        13.0
Name: Salary, dtype: float64

In [200]:
# applicaton #
salaries4.loc[
    (salaries4["Country"]=="United Kingdom") & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"
] = salaries4.loc[(salaries4["Country"]=="United Kingdom") & (salaries4["ConvertedSalary"].isnull()),"Salary"]*1.30

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [201]:
salaries4.loc[
    (salaries4["Country"]=="United Kingdom") & (salaries4["ConvertedSalary"].isnull()),"ConvertedSalary"
]

Series([], Name: ConvertedSalary, dtype: float64)

In [202]:
# for Canada to USD*0.77610 #
salaries4.loc[(salaries4["Country"]=="Canada") & (salaries4["ConvertedSalary"].isnull()),["Country","Salary","ConvertedSalary"]]

      Country    Salary  ConvertedSalary
1810   Canada   15000.0              NaN
4099   Canada    3600.0              NaN
12571  Canada      56.5              NaN
17607  Canada   21408.0              NaN
19398  Canada   16000.0              NaN
20113  Canada   17000.0              NaN
21724  Canada   15000.0              NaN
26160  Canada    1050.0              NaN
27928  Canada   24000.0              NaN
30970  Canada  110000.0              NaN
34816  Canada   70000.0              NaN
40782  Canada   42000.0              NaN
41736  Canada    4500.0              NaN
49820  Canada    1853.0              NaN
52501  Canada      92.0              NaN
53235  Canada   20000.0              NaN
54691  Canada     130.0              NaN
62674  Canada  760000.0              NaN
63702  Canada   61000.0              NaN
63857  Canada   50000.0              NaN
71859  Canada    8000.0              NaN
72242  Canada   12000.0              NaN
72879  Canada    1600.0              NaN
73421  Canada    2732.0              NaN
74755  Canada  133000.0              NaN
76259  Canada   20000.0              NaN
87399  Canada    1000.0              NaN
89695  Canada    7000.0              NaN

In [203]:
# Values need conversion #
salaries4.loc[(salaries4["Country"]=="Canada") & (salaries4["ConvertedSalary"].isnull()), "ConvertedSalary"]

1810    NaN
4099    NaN
12571   NaN
17607   NaN
19398   NaN
20113   NaN
21724   NaN
26160   NaN
27928   NaN
30970   NaN
34816   NaN
40782   NaN
41736   NaN
49820   NaN
52501   NaN
53235   NaN
54691   NaN
62674   NaN
63702   NaN
63857   NaN
71859   NaN
72242   NaN
72879   NaN
73421   NaN
74755   NaN
76259   NaN
87399   NaN
89695   NaN
Name: ConvertedSalary, dtype: float64

In [204]:
# conversion #
salaries4.loc[(salaries4["Country"]=="Canada") & (salaries4["ConvertedSalary"].isnull()), "Salary"]*0.77610

1810      11641.50000
4099       2793.96000
12571        43.84965
17607     16614.74880
19398     12417.60000
20113     13193.70000
21724     11641.50000
26160       814.90500
27928     18626.40000
30970     85371.00000
34816     54327.00000
40782     32596.20000
41736      3492.45000
49820      1438.11330
52501        71.40120
53235     15522.00000
54691       100.89300
62674    589836.00000
63702     47342.10000
63857     38805.00000
71859      6208.80000
72242      9313.20000
72879      1241.76000
73421      2120.30520
74755    103221.30000
76259     15522.00000
87399       776.10000
89695      5432.70000
Name: Salary, dtype: float64

In [205]:
# applicaton #
salaries4.loc[
    (salaries4["Country"]=="Canada") & (salaries4["ConvertedSalary"].isnull()), "ConvertedSalary"
] = salaries4.loc[(salaries4["Country"]=="Canada") & (salaries4["ConvertedSalary"].isnull()), "Salary"]*0.77610

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [206]:
salaries4.loc[
    (salaries4["Country"]=="Canada") & (salaries4["ConvertedSalary"].isnull()), "ConvertedSalary"
]

Series([], Name: ConvertedSalary, dtype: float64)

In [207]:
# Show remaining null values in converted col #
salaries4.loc[salaries4["ConvertedSalary"].isnull(), ["Country","Salary","ConvertedSalary"]]

             Country   Salary  ConvertedSalary
7312   United States      1.0              NaN
7553   United States   5750.0              NaN
10262  United States    115.0              NaN
12695  United States  13000.0              NaN
14362  United States  20000.0              NaN
...              ...      ...              ...
85199  United States    300.0              NaN
87859  United States   6000.0              NaN
88872  United States  20000.0              NaN
89413  United States   1000.0              NaN
89623  United States   4000.0              NaN

[62 rows x 3 columns]

In [208]:
# show countries with null values #
salaries4.loc[salaries4["ConvertedSalary"].isnull(),["Country"]].value_counts()

Country
United States    62
dtype: int64

In [209]:
# For USA #
salaries4.loc[salaries4["ConvertedSalary"].isnull(),"ConvertedSalary"] = salaries4.loc[salaries4["ConvertedSalary"].isnull(),"Salary"]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [210]:
salaries4.loc[salaries4["ConvertedSalary"].isnull(),["Salary","ConvertedSalary"]]

Empty DataFrame
Columns: [Salary, ConvertedSalary]
Index: []

In [211]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  26085 non-null  object
 9   Salary               26085 non-null  float64
 10  ConvertedSalary      26085 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 3.4+ MB

**LanguageWorkedWith**

In [213]:
salaries4["LanguageWorkedWith"].unique()

array(['JavaScript;Python;Bash/Shell',
       'Java;JavaScript;Python;TypeScript;HTML;CSS',
       'JavaScript;HTML;CSS', ..., 'C;C++;HTML;CSS', 'C++;Java;VB.NET',
       'Assembly;C;C++;Java;Python;Scala;Ocaml'], dtype=object)

In [214]:
salaries4["LanguageWorkedWith"].value_counts()

C#;JavaScript;SQL;HTML;CSS                                                        541
C#;JavaScript;SQL;TypeScript;HTML;CSS                                             338
JavaScript;PHP;SQL;HTML;CSS                                                       337
JavaScript;PHP;SQL;HTML;CSS;Bash/Shell                                            287
JavaScript;HTML;CSS                                                               264
                                                                                 ...
Groovy;Java;Ruby;SQL                                                                1
C++;Java;JavaScript;PHP;SQL;Swift;TypeScript;Kotlin;HTML;CSS                        1
C#;Java;JavaScript;Objective-C;PHP;Python;SQL;Swift;Kotlin;Bash/Shell               1
Java;JavaScript;Objective-C;Python;R;Ruby;Swift;TypeScript;HTML;CSS;Bash/Shell      1
C++;Lua;Objective-C                                                                 1
Name: LanguageWorkedWith, Length: 11173, dtype: int64

In [219]:
salaries4["LanguageWorkedWith"].str.split(";").str[0]

1        JavaScript
5              Java
6        JavaScript
8          Assembly
22               C#
            ...
89904             C
89911           C++
89928    JavaScript
89932      Assembly
89965             C
Name: LanguageWorkedWith, Length: 26085, dtype: object

In [223]:
salaries4.loc[salaries4["LanguageWorkedWith"].isnull(),"LanguageWorkedWith"]

202      NaN
314      NaN
425      NaN
443      NaN
448      NaN
        ...
88521    NaN
88645    NaN
88705    NaN
88945    NaN
89758    NaN
Name: LanguageWorkedWith, Length: 579, dtype: object

In [224]:
sal6 = salaries4.copy()

In [225]:
sal6.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  26085 non-null  object
 9   Salary               26085 non-null  float64
 10  ConvertedSalary      26085 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 3.4+ MB

In [227]:
sal6["LanguageWorkedWithFirst"] = sal6["LanguageWorkedWith"].str.split(";").str[0]

In [228]:
sal6.head()

,Country,Employment,FormalEducation,DevType,YearsCodingProf,EducationTypes,LanguageWorkedWith,FrameworkWorkedWith,Age,Salary,ConvertedSalary,LanguageWorkedWithFirst
1,United Kingdom,Employed full-time,Medium,Database administrator,19,"Taught yourself a new language, framework, or ...",JavaScript;Python;Bash/Shell,Django,40,51000.0,70841.0,JavaScript
5,United Kingdom,Employed full-time,Medium,Back-end developer,5,Received on-the-job training in software devel...,Java;JavaScript;Python;TypeScript;HTML;CSS,Angular;Node.js,21,30000.0,41671.0,Java
6,United States,Employed full-time,Medium,Back-end developer,1,Received on-the-job training in software devel...,JavaScript;HTML;CSS,Node.js;React,21,120000.0,120000.0,JavaScript
8,United States,Employed full-time,Medium,Back-end developer,22,Taken an online course in programming or softw...,Assembly;CoffeeScript;Erlang;Go;JavaScript;Lua...,Hadoop;Node.js;React;Spark,40,250000.0,250000.0,Assembly
22,United Kingdom,Employed full-time,Medium,Back-end developer,7,"Taught yourself a new language, framework, or ...",C#;JavaScript;PHP;SQL;HTML;CSS,.NET Core,30,25.0,420.0,C#

In [ ]:
# FOR NOW WE ARE NOT INCLUDING "LanguageWorkedWith" AND "FrameworkWorkedWith" IN THE DATAFRAME #

In [229]:
salaries4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26085 entries, 1 to 89965
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              26085 non-null  object
 1   Employment           26085 non-null  object
 2   FormalEducation      26085 non-null  object
 3   DevType              26085 non-null  object
 4   YearsCodingProf      26085 non-null  int64
 5   EducationTypes       26085 non-null  object
 6   LanguageWorkedWith   25506 non-null  object
 7   FrameworkWorkedWith  17971 non-null  object
 8   Age                  26085 non-null  object
 9   Salary               26085 non-null  float64
 10  ConvertedSalary      26085 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 3.4+ MB

In [232]:
salaries4.columns

Index(['Country', 'Employment', 'FormalEducation', 'DevType',
       'YearsCodingProf', 'EducationTypes', 'LanguageWorkedWith',
       'FrameworkWorkedWith', 'Age', 'Salary', 'ConvertedSalary'],
      dtype='object')

In [234]:
salariesdf = salaries4[['Country', 'Employment', 'FormalEducation', 'DevType','YearsCodingProf', 'EducationTypes', 'Age', 'Salary', 'ConvertedSalary']]

In [240]:
salariesdf.to_csv("FinalSalaries.csv",index=False)